Catalogs/КлассификаторЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторЗанятий</Name>
			<Comment>АПК:58 Отличие оправдано</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтрольноеЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппЗанятий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторЗанятий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение и обновление информационной базы.
Процедура НачальноеЗаполнение() Экспорт
	Обновить(ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст(), Ложь);
КонецПроцедуры

// Обновляет данные регистра.
Процедура Обновить(ТекстXML, ПолучатьДанныеИзСервиса = Истина) Экспорт
	ЗарплатаКадры.ОбновитьКлассификатор(ТекстXML, ПолучатьДанныеИзСервиса);
КонецПроцедуры

Процедура ЗагрузитьКлассификатор(ТаблицаСоСсылками) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСоСсылками", ТаблицаСоСсылками);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеКлассификатора.Код КАК Код,
		|	ДанныеКлассификатора.КонтрольноеЧисло КАК КонтрольноеЧисло,
		|	ДанныеКлассификатора.НаименованиеГруппЗанятий КАК НаименованиеГруппЗанятий
		|ПОМЕСТИТЬ ВТДанныеКлассификатора
		|ИЗ
		|	&ТаблицаСоСсылками КАК ДанныеКлассификатора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСправочника.Ссылка КАК Ссылка,
		|	ДанныеКлассификатора.Код КАК Код,
		|	ДанныеКлассификатора.КонтрольноеЧисло КАК КонтрольноеЧисло,
		|	ДанныеКлассификатора.НаименованиеГруппЗанятий КАК НаименованиеГруппЗанятий
		|ИЗ
		|	ВТДанныеКлассификатора КАК ДанныеКлассификатора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЗанятий КАК ДанныеСправочника
		|		ПО (ДанныеКлассификатора.Код = ЕСТЬNULL(ДанныеСправочника.Код, НЕОПРЕДЕЛЕНО))";
	
	Родители = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			
			Если СтрДлина(Выборка.Код) < 4 Тогда
				ОбъектСправочника = СоздатьГруппу();
			Иначе
				ОбъектСправочника = СоздатьЭлемент();
			КонецЕсли;
			
			ОбъектСправочника.Родитель = Родители.Получить(Лев(Выборка.Код, СтрДлина(Выборка.Код) - 1));
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбъектСправочника, Выборка, , "Ссылка");
		ОбъектСправочника.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
		
		Если СтрДлина(ОбъектСправочника.Код) < 4 Тогда
			Родители.Вставить(ОбъектСправочника.Код, ОбъектСправочника.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
